src/Documents/Премия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Премия</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетЗатрат</xr:Item>
				<xr:Item>CalculationRegister.Начисления</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРасчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоказательРасчета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CalculationRegisters/Начисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<CalculationRegister>
		<Properties>
			<Name>Начисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>true</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<Schedule>InformationRegister.ГрафикиРаботыПредприятия</Schedule>
			<ScheduleValue>InformationRegister.ГрафикиРаботыПредприятия.Resource.КоличествоЧасов</ScheduleValue>
			<ScheduleDate>InformationRegister.ГрафикиРаботыПредприятия.Dimension.День</ScheduleDate>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.Начисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПоказательРасчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>График</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботыСотрудников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

src/AccumulationRegisters/УчетЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>УчетЗатрат</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/Премия/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(_, __, ___)
    Если ЗначениеЗаполнено(ЭтотОбъект.АвторДокумента) = Ложь Тогда
        ЭтотОбъект.АвторДокумента = ПараметрыСеанса.ТекущийПользователь;
    КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(отказ, __)
    результатДвижений = выполнитьВсеДвиженияДокумента();
    Если результатДвижений.Успех = Ложь Тогда
        отказ = Истина;
    КонецЕсли;
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий

#Область СлужебныеПроцедурыИФункции

#Область Движения
Функция выполнитьВсеДвиженияДокумента()
    результат = Новый Структура("Успех", Истина);

    результатПроверки = проверитьЗаполнениеСтатейЗатратДляВидовРасчета();
    Если результатПроверки.Успех = Ложь Тогда
        Для Каждого сообщение Из результатПроверки.СообщенияОбОшибках Цикл
            сообщение.Сообщить();
        КонецЦикла;

        результат.Успех = Ложь;
        Возврат результат;
    КонецЕсли;

    // Движения по регистру Начисления
    выполнитьВсеДвиженияНачислений();
    ЭтотОбъект.Движения.Начисления.Записывать = Истина;
    ЭтотОбъект.Движения.Начисления.Записать();
    ЭтотОбъект.Движения.Начисления.РассчитатьСуммуНачисления();

    // Движения по регистру УчетЗатрат
    ЭтотОбъект.Движения.УчетЗатрат.Записывать = Истина;
    данныеНачислений = РегистрыРасчета.Начисления.ПолучитьДанныеНачисленийДокументаРегистратора(ЭтотОбъект.Ссылка, Истина);
    Для Каждого статьяЗатратНачисления Из данныеНачислений.НачисленияПоСтатьямЗатрат Цикл
        выполнитьДвижениеУчетЗатратОборот(статьяЗатратНачисления.статьяЗатрат, статьяЗатратНачисления.Сумма);
    КонецЦикла;

    // Движения по регистру Хозрасчетный
    ЭтотОбъект.Движения.Хозрасчетный.Записывать = Истина;
    Для Каждого структураНачисления Из данныеНачислений.Начисления Цикл
        выполнитьДвижениеНачислениеПремииБухучет(структураНачисления);
    КонецЦикла;

    Возврат результат;
КонецФункции

Процедура выполнитьВсеДвиженияНачислений()
    Для Каждого строкаНачисления Из ЭтотОбъект.Начисления Цикл
        структураНачисления = РегистрыРасчета.Начисления.СоздатьПустуюСтруктуруНачисления();

        ЗаполнитьЗначенияСвойств(структураНачисления, строкаНачисления);
        структураНачисления.ДатаНачала = НачалоМесяца(ЭтотОбъект.ПериодНачисления);
        структураНачисления.ДатаОкончания = КонецМесяца(ЭтотОбъект.ПериодНачисления);

        ЭтотОбъект.Движения.Начисления.ДобавитьНачисление(ЭтотОбъект.ПериодНачисления, структураНачисления);
    КонецЦикла;
КонецПроцедуры

// Параметры:
//  структураНачисления - Структура, ФиксированнаяСтруктура
//      * ВидРасчета - ПланВидовРасчетаСсылка.Начисления
//      * ДатаНачала - Дата
//      * ДатаОкончания - Дата
//      * Сотрудник - СправочникСсылка.Сотрудник
//      * ПоказательРасчета - Число
//      * График - СправочникСсылка.График
//      * Сумма - Число, Неопределено
Процедура выполнитьДвижениеНачислениеПремииБухучет(Знач структураНачисления)
    ЭтотОбъект.Движения.Хозрасчетный.ДобавитьЗаписьРасчетаСПерсоналом(
        ЭтотОбъект.Дата, структураНачисления, "Отражено начисление премии сотрудникам");
КонецПроцедуры

Процедура выполнитьДвижениеУчетЗатратОборот(Знач статьяЗатрат, Знач сумма)
    движение = Движения.УчетЗатрат.Добавить();
    движение.Период = ЭтотОбъект.Дата;
    движение.СтатьяЗатрат = статьяЗатрат;
    движение.Сумма = сумма;
КонецПроцедуры

Функция проверитьЗаполнениеСтатейЗатратДляВидовРасчета()
    результат = Новый Структура("Успех, СообщенияОбОшибках", Истина);

    списокВидовРасчета = ЭтотОбъект.Начисления.ВыгрузитьКолонку("ВидРасчета");
    Если списокВидовРасчета.Количество() = 0 Тогда
        Возврат результат;
    КонецЕсли;

    таблицаСтатейЗатрат = ПланыВидовРасчета.Начисления.ПолучитьСтатьиЗатратСпискаВидовРасчета(списокВидовРасчета);
    сообщенияОбОшибках = Новый Массив;
    Для Каждого строкаТаблицы Из таблицаСтатейЗатрат Цикл
        Если ЗначениеЗаполнено(строкаТаблицы.СтатьяЗатрат) = Ложь Тогда
            результат.Успех = Ложь;

            сообщение = Новый СообщениеПользователю;
            сообщение.Текст = СтрШаблон(
                    "Для вида расчета: ""%1"" не заполнена статья затрат.
                    |Для проведения документа - статьи затрат всех видов расчета начислений документа должны быть заполнены.",
                    Строка(строкаТаблицы.ВидРасчета));
            сообщенияОбОшибках.Добавить(сообщение);
        КонецЕсли;
    КонецЦикла;

    ДиагностикаКлиентСервер.Утверждение(результат.Успех = Истина ИЛИ сообщенияОбОшибках <> Неопределено);
    Если результат.Успех = Ложь Тогда
        результат.СообщенияОбОшибках = сообщенияОбОшибках;
    КонецЕсли;

    Возврат результат;
КонецФункции
#КонецОбласти // Движения

#КонецОбласти // СлужебныеПроцедурыИФункции
